/**
	************************************************************
	************************************************************
	************************************************************
	*	文件名： 	at24c02.c
	*
	*	作者： 		Sunnycee
	*
	*	日期： 		2020-03-02
	*
	*	版本： 		V1.0
	*
	*	说明： 		AT24C02驱动程序
	*
	*	修改记录：	
	************************************************************
	************************************************************
	************************************************************
**/
#include "at24c02.h"
#include "i2c.h"

/*
************************************************************
*	函数名称：	AT24C02_Init
*
*	函数功能：	AT24C02初始化
*
*	入口参数：	无
*
*	返回参数：	无
*
*	说明：	 无
************************************************************
*/
void AT24C02_Init()
{
	My_I2C_Init();
}


/*
************************************************************
*	函数名称：	AT24C02_WriteByte
*
*	函数功能：	向AT24C02写入一个字节的数据
*
*	入口参数：	word_add：字节地址  data：需要写入的数据
*
*	返回参数：	无
*
*	说明：	 无
************************************************************
*/
void AT24C02_WriteByte(u8 word_add, u8 data)
{
	My_I2C_Start();
	My_I2C_WriteByte(DEVICE_ADDR);
	My_I2C_WaitACK();
	My_I2C_WriteByte(word_add);
	My_I2C_WaitACK();
	My_I2C_WriteByte(data);
	My_I2C_WaitACK();	
	My_I2C_Stop();	
}


/*
************************************************************
*	函数名称：	AT24C02_ReadByte
*
*	函数功能：	读一个字节数据
*
*	入口参数：	word_add：字节地址
*
*	返回参数：	无
*
*	说明：	 无
************************************************************
*/
u8 AT24C02_ReadByte(u8 word_add)
{
	u8 recv_data;
	
	My_I2C_Start();
	My_I2C_WriteByte(DEVICE_ADDR);
	My_I2C_WaitACK();
	My_I2C_WriteByte(word_add);
	My_I2C_WaitACK();
	
	My_I2C_Start();	
	My_I2C_WriteByte(DEVICE_ADDR+1);
	My_I2C_WaitACK();
  recv_data = My_I2C_ReadByte(0);
	My_I2C_Stop();	
	
	return recv_data;
}

